In [139]:
# Import required libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [140]:
# Import home prices dataset

homeprice = pd.read_csv(r"C:\Users\dwara\Downloads\homeprices1.csv")
homeprice.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [141]:
homeprice.isnull().any()

area        False
bedrooms     True
age         False
price       False
dtype: bool

In [142]:
X = np.array(homeprice['area']).reshape(-1,1)
y = homeprice['price']

In [143]:
model = LinearRegression()

In [144]:
model.fit(X, y)
print("The intercept is:", model.intercept_)
print("The coefficient is:", model.coef_)

The intercept is: 76692.3818707813
The coefficient is: [167.30954677]

In [145]:
y_pred_3300 = model.predict(pd.DataFrame([3300]))
y_pred_5000 = model.predict(pd.DataFrame([5000]))
print("The price for a house with area of 3300 is:", y_pred_3300)
print("The price for a house with area of 5000 is:", y_pred_5000)

The price for a house with area of 3300 is: [628813.88621022]
The price for a house with area of 5000 is: [913240.11571842]

In [146]:
# Import the hiring data

hiring = pd.read_csv(r"C:\Users\dwara\Downloads\hiring.csv")
hiring

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [147]:
hiring.isna().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [148]:
# Define a function to convert experience words to digits
def convert_experience(experience):
    if experience == 'one':
        return 1
    elif experience == 'two':
        return 2
    elif experience == 'three':
        return 3
    elif experience == 'four':
        return 4
    elif experience == 'five':
        return 5
    elif experience == 'six':
        return 6
    elif experience == 'seven':
        return 7
    elif experience == 'eight':
        return 8
    elif experience == 'nine':
        return 9
    elif experience == 'ten':
        return 10
    elif experience == 'eleven':
        return 11
    else:
        return experience

# Apply the conversion function to the 'experience' column
hiring['experience'] = hiring['experience'].apply(convert_experience)

# Print the updated DataFrame
print(hiring)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [149]:
# Handling the missing values and converting 'experience' column to integers
hiring['experience'] = pd.to_numeric(hiring['experience'], errors='coerce')
hiring['experience'] = hiring['experience'].fillna(hiring['experience'].median()).astype(int)
hiring['test_score(out of 10)'] = hiring['test_score(out of 10)'].fillna(hiring['test_score(out of 10)'].mean().astype(float))

hiring

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           6               8.000000                           9      50000
1           6               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [150]:
X = hiring[['experience', 'test_score(out of 10)', 'interview_score(out of 10)']]
y = hiring['salary($)']

In [151]:
model = LinearRegression()
model.fit(X, y)
print("The coefficients of the model are:", model.coef_)
print("The intercept of the model are:", model.intercept_)

The coefficients of the model are: [2823.76559304 1329.00027432 2929.14459978]
The intercept of the model are: 11842.30630773121

In [152]:
# Create a DataFrame with the new data for prediction
new_data = pd.DataFrame({
    'experience': [2],
    'test_score(out of 10)': [9],
    'interview_score(out of 10)': [6]
})

# Make predictions using the trained model
predictions = model.predict(new_data)

# Print the predictions
print("The salary of a person with 2 years experience, test score of 9, interview score of 6 is:" , predictions)

The salary of a person with 2 years experience, test score of 9, interview score of 6 is: [47025.70756135]

In [153]:
# Create a DataFrame with the new data for prediction
new_data = pd.DataFrame({
    'experience': [12],
    'test_score(out of 10)': [10],
    'interview_score(out of 10)': [10]
})

# Make predictions using the trained model
predictions = model.predict(new_data)

# Print the predictions
print("The salary of a person with 12 years experience, test score of 10, interview score of 10 is:" , predictions)

The salary of a person with 12 years experience, test score of 10, interview score of 10 is: [88308.94216519]